# Pandas

!pip install pandas   
or   
!conda install pandas

In [1]:
import pandas as pd
import numpy as np

## Series

In [4]:
ser = pd.Series()
ser

C:\Users\91931\anaconda3\envs\tensorflow_env\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

Series([], dtype: float64)

In [5]:
ser = pd.Series(10)
ser

0    10
dtype: int64

In [6]:
ser = pd.Series([12, 45, 56, 17, 32])
ser

0    12
1    45
2    56
3    17
4    32
dtype: int64

In [7]:
ser = pd.Series([12, 45, 56, 17, 32], dtype = 'double')
ser

0    12.0
1    45.0
2    56.0
3    17.0
4    32.0
dtype: float64

In [8]:
ser = pd.Series([[45, 68], [78, 98], [35, 63]])
ser

0    [45, 68]
1    [78, 98]
2    [35, 63]
dtype: object

## DATAFRAME

In [16]:
data = {
    'wagonr': [10, 2, 3, 5],
    'swift': [11, 1, 4, 6],
    'verna': [5, 6, 5, 6]
}

In [17]:
purchases = pd.DataFrame(data)
purchases

   wagonr  swift  verna
0      10     11      5
1       2      1      6
2       3      4      5
3       5      6      6

In [18]:
purchases = pd.DataFrame(data, index = ['monday', 'tuesday', 'wednesday', 'thursday'])
purchases

           wagonr  swift  verna
monday         10     11      5
tuesday         2      1      6
wednesday       3      4      5
thursday        5      6      6

In [19]:
purchases.loc['monday']

wagonr    10
swift     11
verna      5
Name: monday, dtype: int64

In [20]:
purchases['wagonr']

monday       10
tuesday       2
wednesday     3
thursday      5
Name: wagonr, dtype: int64

In [23]:
purchases.dtypes

wagonr    int64
swift     int64
verna     int64
dtype: object

In [24]:
purchases.wagonr.dtype

dtype('int64')

In [25]:
purchases.swift.dtype

dtype('int64')

In [26]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns = ['a', 'b', 'c'])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### Addition and Deletion in DataFrames

In [28]:
df = pd.DataFrame([[10, 20, 30], [40, 50, 60]])
df

    0   1   2
0  10  20  30
1  40  50  60

In [30]:
ser = pd.Series([70, 80, 90], name='new row')
ser

0    70
1    80
2    90
Name: new row, dtype: int64

In [31]:
df2 = df.append(ser)
df2

          0   1   2
0        10  20  30
1        40  50  60
new row  70  80  90

In [32]:
df3 = df.append(ser, ignore_index = True)
df3

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [35]:
df3 = pd.DataFrame([[100, 110, 120],[120, 120, 130]])
df4 = df.append(df3)
df4

     0    1    2
0   10   20   30
1   40   50   60
0  100  110  120
1  120  120  130

In [36]:
df5 = df.append(df3, ignore_index = True)
df5

     0    1    2
0   10   20   30
1   40   50   60
2  100  110  120
3  120  120  130

In [38]:
df6 = pd.DataFrame({'a': [-9, 44, 8], 'b': [19.5, 7, -20], },
                  index=[1, 2, 3])
df6

    a     b
1  -9  19.5
2  44   7.0
3   8 -20.0

In [39]:
df6.drop(index = 1)

    a     b
2  44   7.0
3   8 -20.0

In [40]:
df6.drop(labels = ['b'], axis = 1)

    a
1  -9
2  44
3   8

In [41]:
df6

    a     b
1  -9  19.5
2  44   7.0
3   8 -20.0

In [42]:
df7 = df6.drop(index = 2, columns = 'b')
df7

   a
1 -9
3  8

## Saving you Files

### 1. Saving dataframe to a csv

In [49]:
df6.to_csv('data.csv', header = True, index = False)

### 2. Saving dataframe to a json file

In [51]:
df6.to_json('data.json')

## Reading data from Files

#### 1. From CSV

In [54]:
df6.to_csv('data.tsv', sep='\t', header = True, index = False)

In [56]:
df = pd.read_csv('data.csv')
df

    a     b
0  -9  19.5
1  44   7.0
2   8 -20.0

In [62]:
df2 = pd.read_csv('data.tsv', sep = '\t')
df2

    a     b
0  -9  19.5
1  44   7.0
2   8 -20.0

In [61]:
df1 = pd.read_csv('data.csv', index_col = 0)
df1

        b
a
-9   19.5
 44   7.0
 8  -20.0

#### 2. From Json

In [64]:
data = pd.read_json('data.json')
data

    a     b
1  -9  19.5
2  44   7.0
3   8 -20.0

#### 3. From SQL Databases

In [66]:
import sqlite3

In [67]:
con = sqlite3.connect('data.db')

In [68]:
table = pd.read_sql_query('select * from users', con)

In [69]:
table

,id,name,PASSWORD,expert,admin
0,3,admin,sha256$kWOcE79c$a9c694285c7ac2c773119d75cd0c7c...,0,1
1,4,user_1,sha256$ciG1BQnX$25144ab8493fca61f4e512a0a74659...,0,0
2,5,user_2,sha256$cW0LBpnX$d1701b108291d0b71575065eecc1a3...,0,0
3,6,user_3,sha256$Cnd2H2aI$d2eb5bf9681fc746bfe1dbada9039a...,0,0
4,7,usertest,sha256$lutlNch0$f93e518a2a0ee20f421b9f78dc1925...,0,0
5,8,expert_1,sha256$inu5irfL$ff3145d7113330c3b47b68f1b4e6a0...,1,0
6,9,expert_2,sha256$bomKp0NZ$bc460b1a9f5a5fe94f8d55533b8d45...,1,0
7,10,sharma,sha256$VnxUOWXF$e344c140426154b10c863a14c27a7b...,1,0
8,11,mishra@coding,sha256$bTH84nMe$266da67076c26d0cc5c5ec98a03b0a...,1,0

In [72]:
table = table.set_index('id')
table

,name,PASSWORD,expert,admin
id,,,,
3,admin,sha256$kWOcE79c$a9c694285c7ac2c773119d75cd0c7c...,0,1
4,user_1,sha256$ciG1BQnX$25144ab8493fca61f4e512a0a74659...,0,0
5,user_2,sha256$cW0LBpnX$d1701b108291d0b71575065eecc1a3...,0,0
6,user_3,sha256$Cnd2H2aI$d2eb5bf9681fc746bfe1dbada9039a...,0,0
7,usertest,sha256$lutlNch0$f93e518a2a0ee20f421b9f78dc1925...,0,0
8,expert_1,sha256$inu5irfL$ff3145d7113330c3b47b68f1b4e6a0...,1,0
9,expert_2,sha256$bomKp0NZ$bc460b1a9f5a5fe94f8d55533b8d45...,1,0
10,sharma,sha256$VnxUOWXF$e344c140426154b10c863a14c27a7b...,1,0
11,mishra@coding,sha256$bTH84nMe$266da67076c26d0cc5c5ec98a03b0a...,1,0

In [89]:
user = pd.Series(['tester', 'sha256fhskjfsdlakjfdksjgf', 0, 0], index = ['id', 'name', 'PASSWORD', 'expert','admin'], name = '12')

In [81]:
table = table.append(user, ignore_index = True)

In [82]:
table

,name,PASSWORD,expert,admin,0,1,2,3,4,id,password
0,admin,sha256$kWOcE79c$a9c694285c7ac2c773119d75cd0c7c...,0.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,user_1,sha256$ciG1BQnX$25144ab8493fca61f4e512a0a74659...,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,user_2,sha256$cW0LBpnX$d1701b108291d0b71575065eecc1a3...,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,user_3,sha256$Cnd2H2aI$d2eb5bf9681fc746bfe1dbada9039a...,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,usertest,sha256$lutlNch0$f93e518a2a0ee20f421b9f78dc1925...,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,expert_1,sha256$inu5irfL$ff3145d7113330c3b47b68f1b4e6a0...,1.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,expert_2,sha256$bomKp0NZ$bc460b1a9f5a5fe94f8d55533b8d45...,1.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,sharma,sha256$VnxUOWXF$e344c140426154b10c863a14c27a7b...,1.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,mishra@coding,sha256$bTH84nMe$266da67076c26d0cc5c5ec98a03b0a...,1.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,12.0,tester,sha256fhskjfsdlakjfdksjgf,0.0,0.0,NaN,NaN
10,NaN,NaN,NaN,NaN,12.0,tester,sha256fhskjfsdlakjfdksjgf,0.0,0.0,NaN,NaN
11,tester,NaN,0.0,0.0,NaN,NaN,NaN,NaN,NaN,12.0,sha256fhskjfsdlakjfdksjgf

In [83]:
table = table.drop(index = [9, 10, 11])

In [84]:
table

,name,PASSWORD,expert,admin,0,1,2,3,4,id,password
0,admin,sha256$kWOcE79c$a9c694285c7ac2c773119d75cd0c7c...,0.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,user_1,sha256$ciG1BQnX$25144ab8493fca61f4e512a0a74659...,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,user_2,sha256$cW0LBpnX$d1701b108291d0b71575065eecc1a3...,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,user_3,sha256$Cnd2H2aI$d2eb5bf9681fc746bfe1dbada9039a...,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,usertest,sha256$lutlNch0$f93e518a2a0ee20f421b9f78dc1925...,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,expert_1,sha256$inu5irfL$ff3145d7113330c3b47b68f1b4e6a0...,1.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,expert_2,sha256$bomKp0NZ$bc460b1a9f5a5fe94f8d55533b8d45...,1.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,sharma,sha256$VnxUOWXF$e344c140426154b10c863a14c27a7b...,1.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,mishra@coding,sha256$bTH84nMe$266da67076c26d0cc5c5ec98a03b0a...,1.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN